benchmark/xmin-horizon/results/s2-pgque/bystander.log
pgbench (18.3, server 17.9 (Debian 17.9-1.pgdg13+1))
starting vacuum...pgbench: error: ERROR:  relation "pgbench_branches" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_tellers" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
pgbench: error: ERROR:  relation "pgbench_history" does not exist
pgbench: detail: (ignoring this error and continuing anyway)
end.
progress: 5.0 s, 103.2 tps, lat 1.402 ms stddev 1.305, 0 failed, lag 1.038 ms, 0 skipped
progress: 10.0 s, 98.0 tps, lat 1.490 ms stddev 1.383, 0 failed, lag 1.116 ms, 0 skipped
progress: 15.0 s, 97.4 tps, lat 1.560 ms stddev 1.380, 0 failed, lag 1.111 ms, 0 skipped
progress: 20.0 s, 102.3 tps, lat 1.906 ms stddev 3.219, 0 failed, lag 1.224 ms, 0 skipped
progress: 25.0 s, 95.9 tps, lat 1.595 ms stddev 1.447, 0 failed, lag 1.155 ms, 0 skipped
progress: 30.0 s, 102.5 tps, lat 1.528 ms stddev 1.479, 0 failed, lag 1.124 ms, 0 skipped
progress: 35.0 s, 98.0 tps, lat 1.476 ms stddev 1.405, 0 failed, lag 1.055 ms, 0 skipped
progress: 40.0 s, 101.5 tps, lat 1.944 ms stddev 4.335, 0 failed, lag 1.268 ms, 0 skipped
progress: 45.0 s, 100.9 tps, lat 1.835 ms stddev 3.602, 0 failed, lag 1.226 ms, 0 skipped
progress: 50.0 s, 93.2 tps, lat 1.418 ms stddev 1.372, 0 failed, lag 0.996 ms, 0 skipped
progress: 55.0 s, 99.6 tps, lat 1.246 ms stddev 1.239, 0 failed, lag 0.912 ms, 0 skipped
progress: 60.0 s, 94.0 tps, lat 1.456 ms stddev 1.361, 0 failed, lag 1.069 ms, 0 skipped
progress: 65.0 s, 98.0 tps, lat 1.380 ms stddev 1.296, 0 failed, lag 0.993 ms, 0 skipped
progress: 70.0 s, 96.2 tps, lat 1.341 ms stddev 1.310, 0 failed, lag 1.000 ms, 0 skipped
progress: 75.0 s, 102.6 tps, lat 1.243 ms stddev 1.186, 0 failed, lag 0.920 ms, 0 skipped
progress: 80.0 s, 99.1 tps, lat 1.401 ms stddev 1.310, 0 failed, lag 1.033 ms, 0 skipped
progress: 85.0 s, 96.1 tps, lat 1.639 ms stddev 2.298, 0 failed, lag 1.120 ms, 0 skipped
progress: 90.0 s, 93.6 tps, lat 1.306 ms stddev 1.273, 0 failed, lag 0.951 ms, 0 skipped
progress: 95.0 s, 98.2 tps, lat 1.260 ms stddev 1.177, 0 failed, lag 0.933 ms, 0 skipped
progress: 100.0 s, 97.6 tps, lat 1.415 ms stddev 1.352, 0 failed, lag 1.014 ms, 0 skipped
progress: 105.0 s, 94.4 tps, lat 1.371 ms stddev 1.242, 0 failed, lag 1.034 ms, 0 skipped
progress: 110.0 s, 98.6 tps, lat 1.513 ms stddev 1.342, 0 failed, lag 1.125 ms, 0 skipped
progress: 115.0 s, 109.4 tps, lat 1.306 ms stddev 1.252, 0 failed, lag 0.986 ms, 0 skipped
progress: 120.0 s, 93.6 tps, lat 1.415 ms stddev 1.638, 0 failed, lag 0.942 ms, 0 skipped
progress: 125.0 s, 105.6 tps, lat 1.279 ms stddev 1.229, 0 failed, lag 0.922 ms, 0 skipped
progress: 130.0 s, 100.2 tps, lat 1.493 ms stddev 1.336, 0 failed, lag 1.050 ms, 0 skipped
progress: 135.0 s, 98.8 tps, lat 1.397 ms stddev 1.279, 0 failed, lag 1.047 ms, 0 skipped
progress: 140.0 s, 102.8 tps, lat 1.388 ms stddev 1.338, 0 failed, lag 0.993 ms, 0 skipped
progress: 145.0 s, 105.4 tps, lat 1.266 ms stddev 1.180, 0 failed, lag 0.913 ms, 0 skipped
progress: 150.0 s, 93.2 tps, lat 1.341 ms stddev 1.257, 0 failed, lag 0.990 ms, 0 skipped
progress: 155.0 s, 104.0 tps, lat 1.289 ms stddev 1.194, 0 failed, lag 0.933 ms, 0 skipped
progress: 160.0 s, 100.4 tps, lat 1.915 ms stddev 2.241, 0 failed, lag 1.247 ms, 0 skipped
progress: 165.0 s, 94.6 tps, lat 1.476 ms stddev 1.391, 0 failed, lag 1.062 ms, 0 skipped
progress: 170.0 s, 93.9 tps, lat 1.384 ms stddev 1.258, 0 failed, lag 0.999 ms, 0 skipped
progress: 175.0 s, 96.8 tps, lat 1.256 ms stddev 1.149, 0 failed, lag 0.912 ms, 0 skipped
transaction type: /Users/nik/github/pgque/.claude/worktrees/agent-a48559ba7fdb1315c/bench/xmin-horizon/scripts/bystander.bench
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 17807
number of failed transactions: 0 (0.000%)
number of transactions skipped: 0 (0.000%)
number of transactions above the 200.0 ms latency limit: 0/17807 (0.000%)
latency average = 1.454 ms
latency stddev = 1.732 ms
rate limit schedule lag: avg 1.040 (max 39.232) ms
initial connection time = 17.411 ms
tps = 98.948716 (without initial connection time)